pickautoparts/app/controllers/autoparts_controller.rb

  def create
    # if(set_order)
    @order.autoparts.create!(autopart_params)
---
INSERT INTO "autoparts" ("name", "img_url", "order_id", "brand_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Brake Lights"], ["img_url", "http://google.com"], ["order_id", 2], ["brand_id", 1], ["created_at", "2020-02-11 14:30:01.228980"], ["updated_at", "2020-02-11 14:30:01.228980"]]

  def update
    @autopart.update(autopart_params)
---
UPDATE "autoparts" SET "name" = ?, "img_url" = ?, "description" = ?, "updated_at" = ? WHERE "autoparts"."id" = ?  [["name", "Universal Gear Stick"], ["img_url", "https://imgur.com/oe0WEhA.png"], ["description", "Replacement kik comes with wax spray"], ["updated_at", "2020-02-13 22:39:09.003819"], ["id", 1]]

  def set_order
    @order = Order.find(params[:order_id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_order_item
    @autopart = @order.autoparts.find_by!(id: params[:id]) if @order
---
SELECT "autoparts".* FROM "autoparts" WHERE "autoparts"."order_id" = ? AND "autoparts"."id" = ? LIMIT ?  [["order_id", 2], ["id", 1], ["LIMIT", 1]]