pickautoparts/app/controllers/brands_controller.rb

INSERT INTO "brands" ("name", "img_url", "created_at", "updated_at", "created_by") VALUES (?, ?, ?, ?, ?)  [["name", "BMW"], ["img_url", "google.com/images"], ["created_at", "2020-02-11 14:46:17.491562"], ["updated_at", "2020-02-11 14:46:17.491562"], ["created_by", "15"]]
---
  def create
    @brand = current_user.brands.create!(brand_params)

SELECT "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_brand
    @brand = Brand.find(params[:id])