pickautoparts/app/controllers/orders_controller.rb

  def create
    @order = current_user.orders.create!(order_params)
---
INSERT INTO "orders" ("user_id", "shipping_Address", "created_at", "updated_at", "created_by") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["shipping_Address", "528 Coventry Drive"], ["created_at", "2020-02-11 14:14:13.519492"], ["updated_at", "2020-02-11 14:14:13.519492"], ["created_by", "15"]]

  def update
    @order.update(order_params)
---
UPDATE "orders" SET "shipping_Address" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["shipping_Address", "Vegas office"], ["updated_at", "2020-02-11 16:51:24.077890"], ["id", 6]]