pickautoparts/app/controllers/public_controller.rb

  def index
  autoparts = Autopart.all
---
SELECT "autoparts".* FROM "autoparts"

  def show
    autopart = Autopart.find_by!(id: params[:id])
---
SELECT "autoparts".* FROM "autoparts" WHERE "autoparts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]