pickautoparts/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("review", "rating", "autopart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["review", "This is a great product"], ["rating", 4], ["autopart_id", 1], ["created_at", "2020-02-11 18:05:37.256526"], ["updated_at", "2020-02-11 18:05:37.256526"]]
---
  def create
    @autopart.reviews.create!(autopart_params)

SELECT "autoparts".* FROM "autoparts" WHERE "autoparts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_autopart
    @autopart = Autopart.find(params[:autopart_id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."autopart_id" = ? AND "reviews"."id" = ? LIMIT ?  [["autopart_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_autopart_review
    @review = @autopart.reviews.find_by!(id: params[:id]) if @order