pickautoparts/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "address", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    user = User.create!(user_params)